Repository: drupalista-br/commerce_cielo
Catalog: translations/commerce_cielo.*.po
Languages: pt_br

source: The Brazilcards Library could not be found or is not properly installed.
pt_br: A biblioteca Brazilcards não pode ser encontrada ou não foi instalada corretamente.

source: Live / Sandbox
pt_br: Produção / Testes

source: Define either if this is a Sandbox enviroment for testing out the webservice or a Live Production Webservice.
pt_br: Determina se as transações serão de teste, através do ambiente de teste da Cielo (Sandbox), ou se as transações serão para valer e, portanto, irão para o ambiente de produção da Cielo.

source: Live Webservice - Real Transactions
pt_br: Ambiente de Produção - Transações Reais

source: Cielo Sandbox - Test enviroment
pt_br: Ambiente de Testes - Servidor de Testes da Cielo

source: Webservice Credentials at CIELO
pt_br: Credenciais junto à CIELO

source: Affiliation ID
pt_br: Código de Filiação

source: This value (filiacao) is provided by Cielo up on subscription.
pt_br: Esse código é fornecido pela Cielo após o vendedor submeter enviar o seu formulário de cadastro.

source: Token Key
pt_br: Chave

source: This value (chave) is provided by Cielo up on subscription.
pt_br: A chave é fornecido pela Cielo após o vendedor submeter enviar o seu formulário de cadastro.

source: Cielo's Language Interface
pt_br: Idioma da Interface Cielo

source: Set the language in which Cielo will provide its webservice responses as well as its user interface for when a client redirection to Cielo is required.
pt_br: Determina o idioma o qual as respostas do webservice ou, quando for o caso, das telas de interação com o comprador quando este é redirecionado para o website da Cielo.

source: Capturing Funds
pt_br: Captura de Fundos

source: Define whether or not to automatically capture the order total amount up on authorization granting.
pt_br: Determina se o valor total do pedido deve ou não ser automaticamente capturado caso a transação seja autorizada.

source: Authorization only (requires manual capturing after checkout)
pt_br: Somente Autorização (Requer captura manual após o fechamento do pedido)

source: Authorization and capture
pt_br: Autorização e captura

source: Authorization Mode
pt_br: Modo de Autorização

source: Define how the card holder authentication will be handled.
pt_br: Determina como será feita a autenticação do titular do cartão.

source: Where do buyers hand over their card details?
pt_br: Onde os compradores irão informar os dados do cartão?

source: At Cielo. Buyers are redirected to Cielo's Website.
pt_br: No website da Cielo. Os compradores são redirecionados para a Cielo.

source: At Merchant. Buyers enter their card details at the merchant's Website.
pt_br: No website do vendedor. Os campos para coletar os dados do cartão serão apresentados aos compradores na tela do Fechamento do Pedido.

source: Should the card holder be authenticated?
pt_br: Deseja que o titular do cartão seja autenticado?

source: This applies on for when Credit card mode type is selected. For Debit cards this will be always YES. Define whether or not the card holder (buyer) will be prompted for card ownership verification.
pt_br: Essa opção se aplica ao modo 'Crédito'. Para o modo 'Débito' essa opção será sempre SIM. Determina se o titular do cartão (comprador) deverá ou não passar pelo processo de verificação de propriedade do cartão.

source: No
pt_br: Não

source: Yes
pt_br: Sim

source: TUNING
pt_br: AJUSTES

source: Bank and card mode specific settings.
pt_br: Configurações específicas relacionadas aos bancos e o tipo de transação (Débito ou Crédito)

source: Debit mode flag support
pt_br: Bandeiras suportadas pela transação de Débito.

source: Define which flags the debit mode supports.
pt_br: Determina quais são as bandeiras suportadas pela transação de Débito.

source: Credit mode flag support
pt_br: Bandeiras suportadas pela transação de Crédito.

source: Define which flags the credit mode supports.
pt_br: Determina quais são as bandeiras suportadas pela transação de Crédito.

source: INSTALLMENT SETTINGS
pt_br: CONFIGURAÇÕES PARA PARCELAMENTO

source: These settings are ignored when the purchase order currency is other than BRL.
pt_br: Essas configurações são ignoradas quando a moeda do pedido é diferente do Real (BRL).

source: Creditor
pt_br: Credor

source: Define who gives credit when payment term is based on installments.
pt_br: Determina quem é o credor quando o pagamento é parcelado.

source: Max number of installments for Visa
pt_br: Número máximo de parcelas permitidas para a Bandeira Visa

source: Defines the max number of installments that a buyer can select at the check out pane when paying with a Visa Credit Card.
pt_br: Determina o número máximo de parcelas que o comprador poderá selecionar no painel do fechamento do pedido quando estiver pagando com um cartão Visa.

source: Max number of installments for Mastercard
pt_br: Número máximo de parcelas permitidas para a Bandeira Mastercard

source: Defines the max number of installments that a buyer can select at the check out pane when paying with a Marstercard Credit Card.
pt_br: Determina o número máximo de parcelas que o comprador poderá selecionar no painel do fechamento do pedido quando estiver pagando com um cartão Mastercard.

source: Max number of installments for Elo
pt_br: Número máximo de parcelas permitidas para a Bandeira Elo

source: Defines the max number of installments that a buyer can select at the check out pane when paying with a Elo Credit Card.
pt_br: Determina o número máximo de parcelas que o comprador poderá selecionar no painel do fechamento do pedido quando estiver pagando com um cartão Elo.

source: Define whether or not the card holder (buyer) will be prompted for card ownership verification.
pt_br: Determina se o titular do cartão (comprador) deverá ou não comprovar (autenticar) que é o proprietário do cartão.

source: No.
pt_br: Não.

source: Yes.
pt_br: Sim.

source: The BrazilCards Library could not be found or is not properly installed.
pt_br: A biblioteca BrazilCards não pode ser encontrada ou foi instalada incorretamente.

source: Sorry for this but the checkout system is misconfigured, please report this to the website administrator.
pt_br: Pedimos desculpas, aparentemente houve um problema na configuração do sistema de fechamento de pedidos. Por favor reporte este problema ao administrador do website.

source: Card Type
pt_br: Tipo de Transação

source: Credit
pt_br: Crédito

source: Debit
pt_br: Débito

source: Card Flag
pt_br: Bandeira do Cartão

source: Number of installments
pt_br: Quantidade de parcelas

source: Security Code
pt_br: Código de Segurança

source: Enter the 3 digits number located at the back of your card.
pt_br: Informe o número com 3 dígitos localizado na parte de trás do seu cartão.

source: Single pay out
pt_br: À vista

source: We received the following error processing your card. Please enter you information again or try a different card.
pt_br: A Cielo retornou o(s) seguinte(s) erro(s) ao processar o seu cartão. Por favor informe os dados do seu cartão novamente ou tente um cartão diferente.

source: Administer Commerce Cielo
pt_br: Administrar Commerce Cielo

source: Capture Commerce Cielo Payments
pt_br: Capturar Pagamentos do Commerce Cielo

source: Void Commerce Cielo Payments
pt_br: Extornar Pagamentos do Commerce Cielo

source: Cielo library is not installed.
pt_br: A biblioteca Cielo não está instalada.

source: Cielo library is not properly installed. The file @file does not exist.
pt_br: A biblioteca Cielo não está instalada corretamente. O arquivo @file não existe.

source: By Credit or Debit Card.
pt_br: Com Cartão de Crédito ou Débito.

source: @parcelax @valor | with No interest
pt_br: @parcelax @valor | Sem Juros

source: Status Code: %code
pt_br: Código de Status: %code

source: <br />Waiting: Buyer was redirected to Cielo.
pt_br: <br />Aguardando: Comprador foi redirecionado para a Cielo.

source: Error Code: %code
pt_br: Código do Erro: %code

source: Error Message: %message
pt_br: Mensagem de Erro: %message

source: Capture
pt_br: Capturar

source: Void
pt_br: Extornar

source: Authorization: @amount
pt_br: Autorização: @amount

source: Order balance: @balance
pt_br: Saldo do pedido: @balance

source: Capture amount
pt_br: Valor da captura

source: What amount do you want to capture?
pt_br: Qual o valor que você gostaria de capturar?

source: Cancel
pt_br: Cancelar

source: You must specify a positive numeric amount to capture.
pt_br: O valor a ser capturado precisa ser numérico e positivo.

source: You cannot capture more than it has been authorized at checkout.
pt_br: Você não pode capturar um valor maior do que o foi previamente autorizado no fechamento do pedido.

source: This authorization has passed its 5 days limit and cannot be captured.
pt_br: Essa transação não pode ser capturada porque já expirou os 5 dias de sua criação.

source: Transaction has been captured successfully.
pt_br: Os fundos para esta transação foram capturados com sucesso.

source: Capturing failed, so the transaction will remain in a pending status.
pt_br: A captura de fundos falhou. O status desta transação continuará como pendente.

source: Are you sure you wanna void this transaction and refund the buyer?
pt_br: Tem certeza que você quer cancelar essa transação e reembolsar o comprador?

source: Status Code: %code (Follow Up)
pt_br: Código de Status: %code (Consulta à Transação Remota)

source: Something unexpected happened. Please contact the store administrator.
pt_br: Algo inexperado ocorreu. Por favor contate o administrador do website.

source: Your payment is under a clearance checking by the card operator. A member of our staff will contact you as soon as it gets clearance.
pt_br: Seu pagamento está sendo processada pela operadora de cartões. Um membro de nossa equipe irá lhe contactar tão logo tenhamos uma resposta sobre esta transação.

source: Your payment has been authorized by the card operator but a member of our staff has to manually analyze this transaction. We will contact you as soon as this transaction gets clearance.
pt_br: Seu pagamento foi autorizado pela operadora de cartões entretanto um membro de nossa equipe deverá aprovar esta transação manualmente. Nós iremos lhe contactar tão logo tenhamos o resultado desta checagem.

source: Your payment was denied by the card operator. Please check with your bank or try a different card.
pt_br: Seu pagamento foi rejeitado pela operadora do cartões. Por favor verifique junto ao seu banco ou tente um cartão diferente.

source: Your payment has been approved.
pt_br: Seu pagamento foi aprovado.

source: Authentication only. (use this only if you know what you are doing.)
pt_br: Não Autorizar (Somente autenticar)

source: Authorize only if authenticaded
pt_br: Autorizar Somente se Autenticada

source: Authorize either authenticated or not
pt_br: Autorizar Autenticada e Não-autenticada

source: Skip authentication and go straight to authorization
pt_br: Autorizar sem passar por autenticação – válido somente para crédito

source: Portuguese
pt_br: Português

source: English
pt_br: Inglês

source: Spanish
pt_br: Espanhol
